Project/Toir/src/InformationRegisters/гкс_ПролонгацияППР/гкс_ПролонгацияППР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПролонгацияППР</name>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НормативныеРемонтыОборудования/торо_НормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудования</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСтратегии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_ПланГрафикРемонта/торо_ПланГрафикРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПланГрафикРемонта</name>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяПростояОборудования</registerRecords>
  <registerRecords>InformationRegister.торо_СоответствиеКорректировокДокументамППР</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОстановленноеОборудование</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыПланированияППР</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеРемонтныеРаботы</registerRecords>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагВыводДиаграммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладВнутреннихЗаказов</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийПланаГрафикаППР</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияВладелец</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеВладелец</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ЦепочкиРемонта</types>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЦепочка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланРемонтов</name>
    <attributes>
      <name>ID</name>
      <comment>ID ремонта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКон</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНач</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID_базы_расчета</name>
      <comment>Id базы расчета</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_замещающего</name>
      <comment>Id замещающего</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачСт</name>
      <comment>Дата начала ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонСт</name>
      <comment>Дата окончания ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещенСт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перенесенный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/CommonModules/гкс_ПересчетППР/Module.bsl
Процедура НайтиППРкПролонгации() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Ссылка КАК Ссылка,
		|	Док.КоличествоПериодов КАК КоличествоПериодов,
		|	Док.ДатаПланирования КАК ДатаПланирования,
		|	Док.ПериодичностьДетализации КАК Периодичность
		|ИЗ
		|	РегистрСведений.гкс_ПролонгацияППР КАК Рег
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПланГрафикРемонта КАК Док
		|		ПО Рег.Документ = Док.Ссылка
		|ГДЕ
		|	Док.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Периодичность = Перечисления.Периодичность.Год Тогда 
			НоваяДатаНачала = ДобавитьМесяц(Выборка.ДатаПланирования, Выборка.КоличествоПериодов * 12);
			ДатаПриближения = ДобавитьМесяц(НоваяДатаНачала, -2);
		ИначеЕсли Выборка.Периодичность = Перечисления.Периодичность.Полугодие Тогда 
			НоваяДатаНачала = ДобавитьМесяц(Выборка.ДатаПланирования, Выборка.КоличествоПериодов * 6);
			ДатаПриближения = ДобавитьМесяц(НоваяДатаНачала, -1);
		ИначеЕсли Выборка.Периодичность = Перечисления.Периодичность.Месяц Тогда 
			НоваяДатаНачала = ДобавитьМесяц(Выборка.ДатаПланирования, Выборка.КоличествоПериодов);
			ДатаПриближения = НоваяДатаНачала - 10 * 86400;
		ИначеЕсли Выборка.Периодичность = Перечисления.Периодичность.Квартал Тогда 
			НоваяДатаНачала = ДобавитьМесяц(Выборка.ДатаПланирования, Выборка.КоличествоПериодов * 4);
			ДатаПриближения = ДобавитьМесяц(НоваяДатаНачала, -2);
		Иначе
			ВключитьПролонгациюППР(Выборка.Ссылка, Ложь);
		КонецЕсли;
		Если ДатаПриближения < ТекущаяДата() Тогда 
			СоздатьИПровестиКопиюППР(Выборка.Ссылка, НоваяДатаНачала);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьИПровестиКопиюППР(СтарыйППР, НоваяДатаНачала)
	ДокОб = СтарыйППР.Скопировать();
	ДокОб.Дата = ТекущаяДата();
	ДокОб.Номер = "";
	ДокОб.ДатаПланирования = НоваяДатаНачала;
	ДокОб.ПланРемонтов.Очистить();
	ДокОб.ИсторияСтатусов.Очистить();
	ДокОб.Согласующие.Очистить();
	ДокОб.Записать();
	//
	ВыполинтьРасчет = Истина;
	#Область Нормативы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	               |	Таб.НомерСтроки,
	               |	Таб.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	               |	Таб.ЭтоЦепочка
	               |ПОМЕСТИТЬ ВТ_ОбъектыРемонтаИзППР
	               |ИЗ
	               |	&Таб КАК Таб
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ВидРемонтныхРабот,
	               |	ОбъектРемонтныхРабот
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОбъектыРемонтаИзППР.ВидРемонтныхРабот,
	               |	ВТ_ОбъектыРемонтаИзППР.НомерСтроки,
	               |	ВТ_ОбъектыРемонтаИзППР.ОбъектРемонтныхРабот,
	               |	ВТ_ОбъектыРемонтаИзППР.ЭтоЦепочка
	               |ИЗ
	               |	ВТ_ОбъектыРемонтаИзППР КАК ВТ_ОбъектыРемонтаИзППР
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	               |		ПО ВТ_ОбъектыРемонтаИзППР.ВидРемонтныхРабот = торо_НормативныеРемонтыОборудования.ВидРемонта
	               |			И ВТ_ОбъектыРемонтаИзППР.ОбъектРемонтныхРабот = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	               |			И (НЕ ВТ_ОбъектыРемонтаИзППР.ЭтоЦепочка)
	               |ГДЕ
	               |	торо_НормативныеРемонтыОборудования.НеУчаствуетВПланировании = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОбъектыРемонтаИзППР.ВидРемонтныхРабот,
	               |	ВТ_ОбъектыРемонтаИзППР.НомерСтроки,
	               |	ВТ_ОбъектыРемонтаИзППР.ОбъектРемонтныхРабот,
	               |	ВТ_ОбъектыРемонтаИзППР.ЭтоЦепочка
	               |ИЗ
	               |	ВТ_ОбъектыРемонтаИзППР КАК ВТ_ОбъектыРемонтаИзППР
	               |ГДЕ
	               |	ВТ_ОбъектыРемонтаИзППР.ЭтоЦепочка
						|	И ВЫРАЗИТЬ(ВТ_ОбъектыРемонтаИзППР.ОбъектРемонтныхРабот КАК Справочник.торо_ОбъектыРемонта).НеУчаствуетВПланировании = ЛОЖЬ";
						
	
	Запрос.УстановитьПараметр("Таб", ДокОб.ОбъектыРемонта.Выгрузить());
	
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		// нет нормативов
		ВыполинтьРасчет = Ложь;
	Иначе
		ОбъектыРемонтаИзППР = Результат.Выгрузить();
	КонецЕсли;
	#КонецОбласти
	Если ВыполинтьРасчет Тогда 
		ТаблицаОбъектыРемонта = Новый ТаблицаЗначений;
		ТаблицаОбъектыРемонта.Колонки.Добавить("ОбъектРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ТаблицаОбъектыРемонта.Колонки.Добавить("ВидРемонтныхРабот",    Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов"));
		
		ТаблицаЦепочки = Новый ТаблицаЗначений;
		ТаблицаЦепочки.Колонки.Добавить("ОбъектРемонтныхРабот", Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта"));
		ТаблицаЦепочки.Колонки.Добавить("Цепочка",              Новый ОписаниеТипов("СправочникСсылка.торо_ЦепочкиРемонта"));
		//
		Для Каждого ОР Из ОбъектыРемонтаИзППР Цикл
			Если ТипЗнч(ОР.ВидРемонтныхРабот) = Тип("СправочникСсылка.торо_ЦепочкиРемонта") Тогда
				НС = ТаблицаЦепочки.Добавить();
				ЗаполнитьЗначенияСвойств(НС,ОР);
				НС.Цепочка = ОР.ВидРемонтныхРабот;
			ИначеЕсли ТипЗнч(ОР.ВидРемонтныхРабот) = Тип("СправочникСсылка.торо_ВидыРемонтов") Тогда
				Если ОР.ОбъектРемонтныхРабот.НеУчаствуетВПланировании тогда Продолжить; КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ТаблицаОбъектыРемонта.Добавить(),ОР);
			КонецЕсли;
		КонецЦикла;
		
		СтруктураДанных = Новый Структура();
		
		
		СтруктураДанных.Вставить("ТаблицаПланРемонтов", ДокОб.ПланРемонтов.Выгрузить());
		
		СтруктураДанных.Вставить("ТаблицаОбъектыРемонта",    ТаблицаОбъектыРемонта);
		СтруктураДанных.Вставить("ТаблицаЦепочки",           ТаблицаЦепочки);
		СтруктураДанных.Вставить("ДатаПланирования",         ДокОб.ДатаПланирования);
		СтруктураДанных.Вставить("ПериодичностьДетализации", ДокОб.ПериодичностьДетализации);
		СтруктураДанных.Вставить("КоличествоПериодов",       ДокОб.КоличествоПериодов);
		//
		ИмяОбработки = "торо_ЗащитаУправлениеРемонтами83";
		ТабР = торо_СЛКСервер.ЗаполнитьПланГрафикППР_Session(ИмяОбработки, СтруктураДанных,, ДокОб.Ссылка);
		ДокОб.ПланРемонтов.Очистить();
		Для Каждого СТ Из ТабР Цикл
			НС = ДокОб.ПланРемонтов.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СТ);
		КонецЦикла;
	КонецЕсли;
	ВключитьПролонгациюППР(СтарыйППР, Ложь);
	ВключитьПролонгациюППР(ДокОб.Ссылка, Истина);
	Попытка
		ДокОб.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		//
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось провести пролонгированный " + Строка(ДокОб.Ссылка);
		Сообщение.Сообщить();
	КонецПопытки;
КонецПроцедуры

Процедура ВключитьПролонгациюППР(Ссылка, Добавить) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	НЗ = РегистрыСведений.гкс_ПролонгацияППР.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Ссылка);
	Если Добавить Тогда 
		НС = НЗ.Добавить();
		НС.Документ = Ссылка;
	КонецЕсли;
	НЗ.Записать();
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ДобавитьЭлементыНаФорму(Форма, Родитель) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	МассРекв = Новый Массив();
	МассРекв.Добавить(Новый РеквизитФормы("гкс_ПродлеватьАвтоматически", Новый ОписаниеТипов("Булево"),, "Автоматическое пролонгирование"));
	Форма.ИзменитьРеквизиты(МассРекв);
	//
	НЭлем = Форма.Элементы.Добавить("гкс_АвтоматическоеПролонгирование", Тип("ПолеФормы"), Родитель);
	НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
	НЭлем.Заголовок = НСтр("ru='Автоматическое пролонгирование'");
	НЭлем.ПутьКДанным = "гкс_ПродлеватьАвтоматически";
	НЭлем.УстановитьДействие("ПриИзменении", "гкс_ПродлеватьАвтоматическиПриИзменении");
	//
	НЗ = РегистрыСведений.гкс_ПролонгацияППР.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить(Форма.Объект.Ссылка);
	НЗ.Прочитать();
	Если НЗ.Количество() Тогда 
		Форма.ЭтотОбъект["гкс_ПродлеватьАвтоматически"] = Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура гкс_ПролонгацияППР() Экспорт
	НайтиППРкПролонгации();
КонецПроцедуры

// Добавлять на форму
//&НаКлиенте
//Процедура гкс_ПродлеватьАвтоматическиПриИзменении(Элемент)
//	гкс_ПересчетППР.ВключитьПролонгациюППР(Объект.Ссылка, ЭтотОбъект["гкс_ПродлеватьАвтоматически"]);
//КонецПроцедуры
